
laws = [
    'Закон РФ от 07.02.1992 N 2300-1 "О защите прав потребителей"',
    'Федеральный закон от 07.02.2011 N 3-ФЗ "О полиции"',
    'Федеральный закон от 27.07.2006 N 152-ФЗ "О персональных данных"',
    'Федеральный закон от 13.12.1996 N 150-ФЗ "Об оружии"',
    'Федеральный закон от 25.04.2002 N 40-ФЗ "Об обязательном страховании гражданской ответственности владельцев транспортных средств"',
    'Федеральный закон от 13.03.2006 N 38-ФЗ "О рекламе"',
    'Федеральный закон от 29.12.2012 N 273-ФЗ "Об образовании в Российской Федерации"',
    'Закон РФ от 27.12.1991 N 2124-1 "О средствах массовой информации"',
    'Федеральный закон от 02.12.1990 N 395-1 "О банках и банковской деятельности"',
    'Федеральный закон от 26.10.2002 N 127-ФЗ "О несостоятельности (банкротстве)"',
    'Федеральный закон от 26.12.1995 N 208-ФЗ "Об акционерных обществах"',
    'Федеральный закон от 16.07.1998 N 102-ФЗ "Об ипотеке (залоге недвижимости)"',
    'Федеральный закон от 02.10.2007 N 229-ФЗ "Об исполнительном производстве"',
    'Федеральный закон от 08.02.1998 N 14-ФЗ "Об обществах с ограниченной ответственностью"',
    'Федеральный закон от 27.05.2003 N 58-ФЗ "О системе государственной службы Российской Федерации"',
    'Федеральный закон от 31.05.2002 N 62-ФЗ "О гражданстве Российской Федерации"',
    'Федеральный закон от 04.05.2011 N 99-ФЗ "О лицензировании отдельных видов деятельности"',
    'Федеральный закон от 17.12.2001 N 173-ФЗ "О трудовых пенсиях в Российской Федерации"',
    'Федеральный закон от 28.12.2013 N 400-ФЗ "О страховых пенсиях"',
    'Федеральный закон от 17.01.1992 N 2202-1 "О прокуратуре Российской Федерации"',
    'Федеральный закон от 27.05.1998 N 76-ФЗ "О статусе военнослужащих"',
    'Федеральный закон от 27.11.2010 N 311-ФЗ "О таможенном регулировании в Российской Федерации"',
    'Федеральный закон от 12.01.1995 N 5-ФЗ "О ветеранах"',
    'Федеральный закон от 28.03.1998 N 53-ФЗ "О воинской обязанности и военной службе"',
    'Федеральный закон от 25.07.2002 N 113-ФЗ "Об альтернативной гражданской службе"',
    'Федеральный закон от 19.05.1995 N 82-ФЗ "Об общественных объединениях"',
    'Федеральный закон от 11.06.2003 N 74-ФЗ "О крестьянском (фермерском) хозяйстве"',
    'Федеральный закон от 30.12.2004 N 215-ФЗ "О жилищных накопительных кооперативах"',
    'Федеральный закон от 12.01.1996 N 7-ФЗ "О некоммерческих организациях"',
    'Федеральный закон от 19.05.1995 N 81-ФЗ "О государственных пособиях гражданам, имеющим детей"',
    'Федеральный закон от 29.12.2006 N 255-ФЗ "Об обязательном социальном страховании на случай временной нетрудоспособности и в связи с материнством"',
    'Федеральный закон от 23.12.2003 N 177-ФЗ "О страховании вкладов в банках Российской Федерации"',
    'Федеральный закон от 10.12.2003 N 173-ФЗ "О валютном регулировании и валютном контроле"',
    'Федеральный закон от 18.06.2001 N 78-ФЗ "О землеустройстве"',
    'Федеральный закон от 08.08.2001 N 129-ФЗ "О государственной регистрации юридических лиц и индивидуальных предпринимателей"',
    'Федеральный закон от 21.07.1997 N 122-ФЗ "О государственной регистрации прав на недвижимое имущество и сделок с ним"',
    'Федеральный закон от 25.07.2002 N 115-ФЗ "О правовом положении иностранных граждан в Российской Федерации"',
    'Федеральный закон от 24.07.2007 N 209-ФЗ "О развитии малого и среднего предпринимательства в Российской Федерации"',
    'Федеральный закон от 07.08.2001 N 115-ФЗ "О противодействии легализации (отмыванию) доходов, полученных преступным путем, и финансированию терроризма"',
    'Федеральный закон от 22.04.1996 N 39-ФЗ "О рынке ценных бумаг"',
    'Федеральный закон от 24.07.1998 N 125-ФЗ "Об обязательном социальном страховании от несчастных случаев на производстве и профессиональных заболеваний"',
    'Федеральный закон от 21.11.2011 N 323-ФЗ "Об основах охраны здоровья граждан в Российской Федерации"',
    'Постановление Правительства РФ от 23.10.1993 N 1090 "О Правилах дорожного движения" (вместе с "Основными положениями по допуску транспортных средств к эксплуатации и обязанности должностных лиц по обеспечению безопасности дорожного движения")'
]


codes = [
    'Гражданский кодекс (ГК РФ)',
    'Налоговый кодекс (НК РФ)',
    'Арбитражный процессуальный кодекс Российской Федерации от 24.07.2002 N 95-ФЗ',
    'Гражданский процессуальный кодекс Российской Федерации от 14.11.2002 N 138-ФЗ',
    'Кодекс административного судопроизводства Российской Федерации от 08.03.2015 N 21-ФЗ',
    'Жилищный кодекс Российской Федерации от 29.12.2004 N 188-ФЗ',
    'Земельный кодекс Российской Федерации от 25.10.2001 N 136-ФЗ',
    'Кодекс Российской Федерации об административных правонарушениях от 30.12.2001 N 195-ФЗ',
    'Семейный кодекс Российской Федерации от 29.12.1995 N 223-ФЗ',
    'Трудовой кодекс Российской Федерации от 30.12.2001 N 197-ФЗ',
    'Уголовный кодекс Российской Федерации от 13.06.1996 N 63-ФЗ',
    'Градостроительный кодекс Российской Федерации от 29.12.2004 N 190-ФЗ'
]


def codes_id_to_str(codes_id: int) -> str:
    return codes[codes_id]

def laws_id_to_str(laws_id: int) -> str:
    return laws[laws_id]